Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.DimensionTextManipulator.DimensionEnteredEventArgs
Event argument class for the Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.DimensionTextManipulator.DimensionEntered event.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.DimensionTextManipulator.DimensionEnteredEventArgs.#ctor(Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.DimensionTextManipulator.InputDirections,System.Double)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.DimensionTextManipulator.DimensionEnteredEventArgs class.
direction: The direction.
value: The value.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.DimensionTextManipulator.DimensionEnteredEventArgs.Direction
Gets the direction.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.DimensionTextManipulator.DimensionEnteredEventArgs.Value
Gets the value.